Revit 2026 API

# SubMenuItem Properties

---

The SubMenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from MenuItem) |

#### Reference

SubMenuItem Class

Autodesk.Revit.UI Namespace